UBCSailbot/winch-system/MSP430FR5739/winch-system/pawl.c
/*
 * pawl.c
 *
 *  Created on: Apr. 3, 2022
 *      Author: mlokh
 */

#include <msp430.h>
#include <stdio.h>
#include "gearmotor.h"
#include "pawl.h"
#include "spi.h"
#include "motor.h"

unsigned int motor_inc_tries = 0;
unsigned int dir = 0;

/**
 * Set the state of the paws to either engaged or disengaged
 * This function depends on a global state - Clockwise, AntiClockwise or REST
 * These state control the main motor is also used to determine which paw to
 * control.
 *
 * Clockwise - Drive gear motor backwards (to the right) to disengage right pawl and engage left.
 *
 * AntiClockwise - Drive gear motor forward (to the left) to disengage left pawl and engage right.
 *
 * REST - Drive gear motor to the middle position (This position is determined by the hall sensor data from left and right pawl).
 *        Depending on which Paw is engaged we move to the opposite direction (to disengage the pawl).
 *        The center is determined by CAM hall sensor data
 *
 * Return: negative when error, 0 when success and 1 when pawl position reached
 */
int move_pawl(unsigned int direction, unsigned int phase) {
    int err = 0;
    switch(direction) {
    case CLOCKWISE:
        err = disengageLeft(phase);
        break;
    case ANTICLOCKWISE:
        err = disengageRight(phase);
        break;
    case REST:
        err = disengageBoth(phase);
        break;

    }

    return err;
}


/**
 * Functions to control pawl movement
 */
static int disengageRight(unsigned int phase) {
    int pawl_right;
    int spi_tries = 0;

    if (phase == INIT_PAWL) {
        receive_hallsensors(NULL, NULL, &pawl_right);

        //-- Error checking to see if we could receive pawl_right data
        if (pawl_right < 0) return -1;

        if (pawl_right <= RIGHT_THRES) {
            //-- Already disengaged (Why?)
            return -2;
        }

        motor_inc_tries = 0;

        //-- Start the gear motor for TODO: figure out how long
        startGearMotor(1, MEDIUM, 100);

    } else {    //-- RUN_PAWL
        if (!isGearMotorOn()) {
            //-- If gear motor has timed out
            if (++motor_inc_tries > MAX_TRIES) return -3;

            incrementMainMotor(CLOCKWISE, 5);

            //-- Start gear motor again
            startGearMotor(1, MEDIUM, 100);
        }

        do{
            receive_hallsensors(NULL, NULL, &pawl_right);
            if (++spi_tries > MAX_TRIES) return -4;
        } while (pawl_right == -1);

        spi_tries = 0;

        if (pawl_right <= RIGHT_THRES) {
            stopGearMotor();
            return 1;
        }
    }

    return 0;
}

static int disengageLeft(unsigned int phase) {
    int pawl_left;
    int spi_tries = 0;

    if (phase == INIT_PAWL) {
        receive_hallsensors(&pawl_left, NULL, NULL);

        //-- Error checking to see if we could receive pawl_right data
        if (pawl_left < 0) return -1;

        if (pawl_left <= LEFT_THRES) {
            //-- Already disengaged (Why?)
            return -2;
        }

        motor_inc_tries = 0;

        //-- Start the gear motor for TODO: figure out how long
        startGearMotor(0, MEDIUM, 100);
    } else {    //-- RUN_PAWL
        if (!isGearMotorOn()) {
            //-- If gear motor has timed out
            if (++motor_inc_tries > MAX_TRIES) return -3;

            incrementMainMotor(ANTICLOCKWISE, 5);

            //-- Start gear motor again
            startGearMotor(0, MEDIUM, 100);
        }

        do{
            receive_hallsensors(&pawl_left, NULL, NULL);
            if (++spi_tries > MAX_TRIES) return -4;
        } while (pawl_left == -1);

        spi_tries = 0;

        if (pawl_left <= LEFT_THRES) {
            stopGearMotor();
            return 1;
        }
    }

    return 0;
}

static int disengageBoth(unsigned int phase) {
    int cam;
    int spi_tries = 0;

    if (phase == INIT_PAWL) {

        //-- set direction to backward
        dir = BACKWARD;

        receive_hallsensors(NULL, &cam, NULL);

        if (cam < 0) return -1;

        cam -= CAM_OFFSET;

        if (cam <= CAM_THRES_UPPER && cam >= CAM_THRES_LOWER) {
            //-- Already disengaged (Why?)
            return -2;
        }

        if (cam > 0) {
            //-- Go backward
            dir = BACKWARD;
        } else {
            //-- Go forward
            dir = FORWARD;
        }

        motor_inc_tries = 0;

        startGearMotor(dir, SLOW, CAM_TIMEOUT);

    } else {    //-- RUN_PAWL
        if (!isGearMotorOn()) {
            if (++motor_inc_tries > MAX_TRIES) return -3;

            startGearMotor(dir, SLOW, CAM_TIMEOUT);
        }

        //-- If cam value is positive and dir is forward. Reverse
        if (cam > 0 && dir || cam < 0 && !dir) {
            stopGearMotor();

            //-- toggle direction
            dir ^= FORWARD;

            //-- Reverse gear motor
            startGearMotor(dir, SLOW, CAM_TIMEOUT);
        }

        do{
            receive_hallsensors(NULL, &cam, NULL);
            if (++spi_tries > MAX_TRIES) return -4;
        } while (cam == -1);

        spi_tries = 0;

        cam -= CAM_OFFSET;

        if (cam <= CAM_THRES_UPPER && cam >= CAM_THRES_LOWER) {
            stopGearMotor();
            return 1;
        }
    }

    return 0;
}


